#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['мать', 'отец','брат']


# список списков приблизителного роста членов вашей семьи
my_family_height = [['отец',180],
                    ['мать',167],
                    ['брат',181]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print('Рост отца - ',my_family_height[0])